In [ ]:
#1. Create a friend_names.csv file delimiter is comma(,)  (atleast 10 names, columns are FriendName,Quality)

In [2]:
import pandas 
import pandas as pd
df1=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\friend_names.txt")
df1

   s.no friend_names      quality
0     1       anitha       clever
1     2       vanaja  intelligent
2     3     sivadevi        funny
3     4     prasanna  hardworking
4     5        bujji       active
5     6     poojitha         good
6     7       sruthi  intelligent
7     8       anusha         best
8     9        dugra        funny
9    10      jayasri       silent

In [3]:
df1.head()

   s.no friend_names      quality
0     1       anitha       clever
1     2       vanaja  intelligent
2     3     sivadevi        funny
3     4     prasanna  hardworking
4     5        bujji       active

In [5]:
df1.tail()

   s.no friend_names      quality
5     6     poojitha         good
6     7       sruthi  intelligent
7     8       anusha         best
8     9        dugra        funny
9    10      jayasri       silent

In [7]:
df1.columns

Index(['s.no', 'friend_names', 'quality'], dtype='object')

In [8]:
df1.shape

(10, 3)

In [9]:
df1.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   s.no          10 non-null     int64
 1   friend_names  10 non-null     object
 2   quality       10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [11]:
type(df1)

pandas.core.frame.DataFrame

In [12]:
df1.dtypes

s.no             int64
friend_names    object
quality         object
dtype: object

In [ ]:
#2. Create a family_members.txt file delimiter is star (*), (atleast 10 names, columns are FamilyMemberName*Relation)

In [15]:
import pandas 
import pandas as pd
df2=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\family_members.txt",sep="*")
df2

   s.no    familymembers        relation
0     1      venkataraju         farther
1     2     dhanalakshmi         morther
2     3    gopalakrishna         brother
3     4  dasaradharamyya     grandfather
4     5      nagedhramma    grandmorther
5     6        bhogiraju  brother_in-law
6     7       nagajyothi          sister
7     8        lakshmana           uncle
8     9          umadevi            aunt
9    10         poojitha          sister

In [16]:
df2.head()

   s.no    familymembers      relation
0     1      venkataraju       farther
1     2     dhanalakshmi       morther
2     3    gopalakrishna       brother
3     4  dasaradharamyya   grandfather
4     5      nagedhramma  grandmorther

In [17]:
df2.tail()

   s.no familymembers        relation
5     6     bhogiraju  brother_in-law
6     7    nagajyothi          sister
7     8     lakshmana           uncle
8     9       umadevi            aunt
9    10      poojitha          sister

In [19]:
df2.columns

Index(['s.no', 'familymembers', 'relation'], dtype='object')

In [20]:
df2.shape

(10, 3)

In [23]:
df2.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   s.no           10 non-null     int64
 1   familymembers  10 non-null     object
 2   relation       10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [25]:
type(df2)

pandas.core.frame.DataFrame

In [26]:
df2.dtypes

s.no              int64
familymembers    object
relation         object
dtype: object

In [ ]:
#3. Create a Vegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are VegFoodName*Taste)

In [2]:
import pandas 
import pandas as pd
df3=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\vegfood_names.txt",sep="|")
df3

   s.no   vegfood_names      taste
0     1       tomatofry       sour
1     2          pongal      sweet
2     3        pulihora       sour
3     4      vegbiryani        hot
4     5     potatochips        hot
5     6           palav  verytaste
6     7            voda        hot
7     8  chakkarapongal  verysweet
8     9       potatofry        hot
9    10        icecream      sweet

In [3]:
df3.head()

   s.no vegfood_names  taste
0     1     tomatofry   sour
1     2        pongal  sweet
2     3      pulihora   sour
3     4    vegbiryani    hot
4     5   potatochips    hot

In [4]:
df3.tail()

   s.no   vegfood_names      taste
5     6           palav  verytaste
6     7            voda        hot
7     8  chakkarapongal  verysweet
8     9       potatofry        hot
9    10        icecream      sweet

In [5]:
df3.columns

Index(['s.no', 'vegfood_names', 'taste'], dtype='object')

In [6]:
df3.shape

(10, 3)

In [7]:
df3.index

RangeIndex(start=0, stop=10, step=1)

In [8]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   s.no           10 non-null     int64
 1   vegfood_names  10 non-null     object
 2   taste          10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [9]:
type(df3)

pandas.core.frame.DataFrame

In [10]:
df3.dtypes

s.no              int64
vegfood_names    object
taste            object
dtype: object

In [ ]:
#4. Create a NonVegfood_items.txt file delimiter is pipe (|), (atleast 10 names, columns are NonVegFoodName*Taste)

In [11]:
import pandas
import pandas as pd
df4=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\nonvegfood_names.txt",sep="|")
df4

   s.no nonvegfood_items      taste
0     1       chickenfry      super
1     2           eggfry      yummy
2     3    muttonbiryani  verytaste
3     4   chickenbiryani      super
4     5       eggbiryani        hot
5     6          fishfry      yummy
6     7    francebiryani  veryyummy
7     8        muttonfry      super
8     9        francefry        hot
9    10        thandoori        hot

In [12]:
df4.head()

   s.no nonvegfood_items      taste
0     1       chickenfry      super
1     2           eggfry      yummy
2     3    muttonbiryani  verytaste
3     4   chickenbiryani      super
4     5       eggbiryani        hot

In [13]:
df4.tail()

   s.no nonvegfood_items      taste
5     6          fishfry      yummy
6     7    francebiryani  veryyummy
7     8        muttonfry      super
8     9        francefry        hot
9    10        thandoori        hot

In [14]:
df4.columns

Index(['s.no', 'nonvegfood_items', 'taste'], dtype='object')

In [15]:
df4.shape

(10, 3)

In [16]:
df4.index

RangeIndex(start=0, stop=10, step=1)

In [17]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   s.no              10 non-null     int64
 1   nonvegfood_items  10 non-null     object
 2   taste             10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [18]:
type(df4)

pandas.core.frame.DataFrame

In [19]:
df4.dtypes

s.no                 int64
nonvegfood_items    object
taste               object
dtype: object

In [ ]:
#5. Create a month_names.txt file delimiter is and (&), (atleast 12 names, columns are MonthName*Season)

In [20]:
import pandas
import pandas as pd
df5=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\month_names.txt",sep="&")
df5

    s.no month_names   season
0      1     january   winter
1      2    february   winter
2      3       march   summar
3      4       april   summar
4      5         may   summar
5      6        june  raniing
6      7        july  raniing
7      8      august  raniing
8      9   september  raniing
9     10     october  raniing
10    11    november   winter
11    12    december   winter

In [21]:
df5.head()

   s.no month_names  season
0     1     january  winter
1     2    february  winter
2     3       march  summar
3     4       april  summar
4     5         may  summar

In [22]:
df5.tail()

    s.no month_names   season
7      8      august  raniing
8      9   september  raniing
9     10     october  raniing
10    11    november   winter
11    12    december   winter

In [23]:
df5.columns

Index(['s.no', 'month_names', 'season'], dtype='object')

In [25]:
df5.shape

(12, 3)

In [24]:
df5.index

RangeIndex(start=0, stop=12, step=1)

In [26]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   s.no         12 non-null     int64
 1   month_names  12 non-null     object
 2   season       12 non-null     object
dtypes: int64(1), object(2)
memory usage: 416.0+ bytes

In [27]:
type(df5)

pandas.core.frame.DataFrame

In [28]:
df5.dtypes

s.no            int64
month_names    object
season         object
dtype: object

In [ ]:
#6. Create a colours_names.txt file delimiter is cap (^), (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)

In [29]:
import pandas
import pandas as pd
df6=pd.read_csv(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\colour_names.txt",sep="^")
df6

   s.no colourname_in_english colourname_in_hindi colourname_in_telugu
0     1                   red                laal                erupu
1     2                 white              safead               telupu
2     3                 green              hariya           akupachcha
3     4                yellow               peela               pasupu
4     5                 black               kaala               nalupu
5     6                  blue               neela               neelam

In [30]:
df6.head()

   s.no colourname_in_english colourname_in_hindi colourname_in_telugu
0     1                   red                laal                erupu
1     2                 white              safead               telupu
2     3                 green              hariya           akupachcha
3     4                yellow               peela               pasupu
4     5                 black               kaala               nalupu

In [31]:
df6.tail()

   s.no colourname_in_english colourname_in_hindi colourname_in_telugu
1     2                 white              safead               telupu
2     3                 green              hariya           akupachcha
3     4                yellow               peela               pasupu
4     5                 black               kaala               nalupu
5     6                  blue               neela               neelam

In [32]:
df6.columns

Index(['s.no', 'colourname_in_english', 'colourname_in_hindi',
       'colourname_in_telugu'],
      dtype='object')

In [33]:
df6.shape

(6, 4)

In [34]:
df6.index

RangeIndex(start=0, stop=6, step=1)

In [35]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   s.no                   6 non-null      int64
 1   colourname_in_english  6 non-null      object
 2   colourname_in_hindi    6 non-null      object
 3   colourname_in_telugu   6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [36]:
type(df6)

pandas.core.frame.DataFrame

In [37]:
df6.dtypes

s.no                      int64
colourname_in_english    object
colourname_in_hindi      object
colourname_in_telugu     object
dtype: object

In [ ]:
#7. Create a friend_names.xls file  (atleast 10 names, columns are FriendName,Quality)

In [38]:
import pandas 
import pandas as pd
df7=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\friend_names.xlsx")
df7

   s.no friend_names      quality
0     1       anitha       celver
1     2       vanaja  intelligent
2     3     sivadevi        funny
3     4     prasanna  hardworking
4     5        bujji       active
5     6     poojitha         good
6     7       sruthi  intelligent
7     8       anusha         best
8     9        durga        funny
9    10      jayasri       silent

In [39]:
df7.head()

   s.no friend_names      quality
0     1       anitha       celver
1     2       vanaja  intelligent
2     3     sivadevi        funny
3     4     prasanna  hardworking
4     5        bujji       active

In [40]:
df7.tail()

   s.no friend_names      quality
5     6     poojitha         good
6     7       sruthi  intelligent
7     8       anusha         best
8     9        durga        funny
9    10      jayasri       silent

In [41]:
df7.columns

Index(['s.no', 'friend_names', 'quality'], dtype='object')

In [42]:
df7.shape

(10, 3)

In [43]:
df7.index

RangeIndex(start=0, stop=10, step=1)

In [44]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   s.no          10 non-null     int64
 1   friend_names  10 non-null     object
 2   quality       10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [45]:
type(df7)

pandas.core.frame.DataFrame

In [46]:
df7.dtypes

s.no             int64
friend_names    object
quality         object
dtype: object

In [ ]:
#8. Create a family_members.xls file  (atleast 10 names, columns are FamilyMemberName*Relation)

In [47]:
import pandas 
import pandas as pd
df8=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\family_members.xlsx")
df8

   s.no   family_members        relation
0     1      venkataraju         farther
1     2     dhanalakshmi         morther
2     3    gopalakrishna         brother
3     4  dasaradharamyya     grandfather
4     5      nagedhramma    grandmorther
5     6        bhogiraju  brother_in-law
6     7       nagajyothi          sister
7     8        lakshmana           uncle
8     9          umadevi            aunt
9    10         poojitha          sister

In [48]:
df8.head()

   s.no   family_members      relation
0     1      venkataraju       farther
1     2     dhanalakshmi       morther
2     3    gopalakrishna       brother
3     4  dasaradharamyya   grandfather
4     5      nagedhramma  grandmorther

In [49]:
df8.tail()

   s.no family_members        relation
5     6      bhogiraju  brother_in-law
6     7     nagajyothi          sister
7     8      lakshmana           uncle
8     9        umadevi            aunt
9    10       poojitha          sister

In [50]:
df8.columns

Index(['s.no', 'family_members', 'relation'], dtype='object')

In [51]:
df8.shape

(10, 3)

In [52]:
df8.index

RangeIndex(start=0, stop=10, step=1)

In [53]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   s.no            10 non-null     int64
 1   family_members  10 non-null     object
 2   relation        10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [54]:
type(df8)

pandas.core.frame.DataFrame

In [55]:
df8.dtypes

s.no               int64
family_members    object
relation          object
dtype: object

In [ ]:
#9. Create a Vegfood_items.xlsx file  (atleast 10 names, columns are VegFoodName*Taste)

In [57]:
import pandas 
import pandas as pd
df9=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\vegfood_names.xlsx")
df9

   s.no   vegfood_items        hot
0     1       tomatofry       sour
1     2          pongal      sweet
2     3        pulihora       sour
3     4      vegbiryani        hot
4     5     potatochips        hot
5     6           palav  verytaste
6     7            voda        hot
7     8  chakkarapongal  verysweet
8     9       potatofry        hot
9    10        icecream      sweet

In [58]:
df9.head()

   s.no vegfood_items    hot
0     1     tomatofry   sour
1     2        pongal  sweet
2     3      pulihora   sour
3     4    vegbiryani    hot
4     5   potatochips    hot

In [59]:
df9.tail()

   s.no   vegfood_items        hot
5     6           palav  verytaste
6     7            voda        hot
7     8  chakkarapongal  verysweet
8     9       potatofry        hot
9    10        icecream      sweet

In [60]:
df9.columns

Index(['s.no', 'vegfood_items', 'hot'], dtype='object')

In [61]:
df9.shape

(10, 3)

In [62]:
df9.index

RangeIndex(start=0, stop=10, step=1)

In [63]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   s.no           10 non-null     int64
 1   vegfood_items  10 non-null     object
 2   hot            10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [64]:
type(df9)

pandas.core.frame.DataFrame

In [65]:
df9.dtypes

s.no              int64
vegfood_items    object
hot              object
dtype: object

In [ ]:
#10. Create a NonVegfood_items.xlsx file  (atleast 10 names, columns are NonVegFoodName*Taste)

In [66]:
import pandas
import pandas as pd
df10=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\nonvegfood_names.xlsx")
df10

   s.no nonvegfood_items      taste
0     1       chickenfry      super
1     2           eggfry      yummy
2     3    muttonbiryani  verytaste
3     4   chickenbiryani      super
4     5       eggbiryani        hot
5     6          fishfry      yummy
6     7    francebiryani  veryyummy
7     8    francebiryani      super
8     9        francefry        hot
9    10        thandoori        hot

In [67]:
df10.head()

   s.no nonvegfood_items      taste
0     1       chickenfry      super
1     2           eggfry      yummy
2     3    muttonbiryani  verytaste
3     4   chickenbiryani      super
4     5       eggbiryani        hot

In [68]:
df10.tail()

   s.no nonvegfood_items      taste
5     6          fishfry      yummy
6     7    francebiryani  veryyummy
7     8    francebiryani      super
8     9        francefry        hot
9    10        thandoori        hot

In [69]:
df10.columns

Index(['s.no', 'nonvegfood_items', 'taste'], dtype='object')

In [70]:
df10.shape

(10, 3)

In [71]:
df10.index

RangeIndex(start=0, stop=10, step=1)

In [72]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   s.no              10 non-null     int64
 1   nonvegfood_items  10 non-null     object
 2   taste             10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [73]:
type(df10)

pandas.core.frame.DataFrame

In [74]:
df10.dtypes

s.no                 int64
nonvegfood_items    object
taste               object
dtype: object

In [ ]:
#11. Create a month_names.xlsx file (atleast 12 names, columns are MonthName*Season)

In [75]:
import pandas 
import pandas as pd
df11=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\month_names.xlsx")
df11

    s.no month_names   season
0      1     january   winter
1      2    february   winter
2      3       march   summar
3      4       april   summar
4      5         may   summar
5      6        june   summar
6      7        july  raniing
7      8      august  raniing
8      9   september  raniing
9     10     october  raniing
10    11    november   winter
11    12    december   winter

In [76]:
df11.head()

   s.no month_names  season
0     1     january  winter
1     2    february  winter
2     3       march  summar
3     4       april  summar
4     5         may  summar

In [77]:
df11.tail()

    s.no month_names   season
7      8      august  raniing
8      9   september  raniing
9     10     october  raniing
10    11    november   winter
11    12    december   winter

In [78]:
df11.columns

Index(['s.no', 'month_names', 'season'], dtype='object')

In [79]:
df11.shape

(12, 3)

In [80]:
df11.index

RangeIndex(start=0, stop=12, step=1)

In [81]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   s.no         12 non-null     int64
 1   month_names  12 non-null     object
 2   season       12 non-null     object
dtypes: int64(1), object(2)
memory usage: 416.0+ bytes

In [83]:
type(df11)

pandas.core.frame.DataFrame

In [84]:
df11.dtypes

s.no            int64
month_names    object
season         object
dtype: object

In [ ]:
#12. Create a colours_names.xlsx file  (atleast 12 names, columns are colourName_in_English^colourName_in_Hindi^colourName_in_Telugu)

In [85]:
import pandas
import pandas as pd
df12=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\swathi_pandas_1\colour_names.xlsx")
df12

,s.no,colourname_in_english,Unnamed: 2,colourname_in_hindi,colourname_in_telugu
0,1,red,NaN,laal,erupu
1,2,white,NaN,safead,telupu
2,3,green,NaN,hariya,akupachcha
3,4,yellow,NaN,peela,pasupu
4,5,black,NaN,kaala,nalupu
5,6,blue,NaN,neela,neelam

In [86]:
df12.head()

,s.no,colourname_in_english,Unnamed: 2,colourname_in_hindi,colourname_in_telugu
0,1,red,NaN,laal,erupu
1,2,white,NaN,safead,telupu
2,3,green,NaN,hariya,akupachcha
3,4,yellow,NaN,peela,pasupu
4,5,black,NaN,kaala,nalupu

In [87]:
df12.tail()

,s.no,colourname_in_english,Unnamed: 2,colourname_in_hindi,colourname_in_telugu
1,2,white,NaN,safead,telupu
2,3,green,NaN,hariya,akupachcha
3,4,yellow,NaN,peela,pasupu
4,5,black,NaN,kaala,nalupu
5,6,blue,NaN,neela,neelam

In [88]:
df12.columns

Index(['s.no', 'colourname_in_english', 'Unnamed: 2', 'colourname_in_hindi',
       'colourname_in_telugu'],
      dtype='object')

In [89]:
df12.shape

(6, 5)

In [90]:
df12.index

RangeIndex(start=0, stop=6, step=1)

In [92]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   s.no                   6 non-null      int64
 1   colourname_in_english  6 non-null      object
 2   Unnamed: 2             0 non-null      float64
 3   colourname_in_hindi    6 non-null      object
 4   colourname_in_telugu   6 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [93]:
type(df12)

pandas.core.frame.DataFrame

In [94]:
df12.dtypes

s.no                       int64
colourname_in_english     object
Unnamed: 2               float64
colourname_in_hindi       object
colourname_in_telugu      object
dtype: object